{
  "Welcome": {
    "Buttons": {
      "Project": "Проект",
      "Developers": "Разработчики",
      "Course": "Курс"
    },
    "GraphiQLAbout": {
      "1": "GraphiQL — это игровая площадка/Интегрированная среда разрабоотки для запросов graphQL.",
      "2": "GraphQL — это язык запросов для вашего API и среда выполнения на стороне сервера для выполнения запросов с использованием системы типов, которую вы определяете для своих данных. GraphQL не привязан к какой-либо конкретной базе данных или механизму хранения, а вместо этого поддерживается вашим существующим кодом и данными",
      "3": "Запросы GraphQL всегда возвращают предсказуемые результаты. Приложения, использующие GraphQL, работают быстро и стабильно, потому что они контролируют получаемые данные, а не сервер.",
      "4": "Запросы GraphQL обращаются не только к свойствам одного ресурса, но и плавно следуют ссылкам между ними. В то время как типичные API REST требуют загрузки с нескольких URL-адресов, API GraphQL получают все данные, необходимые вашему приложению, в одном запросе. Приложения, использующие GraphQL, могут работать быстро даже при медленном подключении к мобильной сети.",
      "5": "API-интерфейсы GraphQL организованы по типам и полям, а не по конечным точкам. Получите доступ ко всем возможностям ваших данных из единой конечной точки. GraphQL использует типы, чтобы приложения запрашивали только то, что возможно, и предоставляли четкие и полезные ошибки. Приложения могут использовать типы, чтобы не писать код синтаксического анализа вручную.",
      "6": "GraphQL был разработан Facebook, который впервые начал использовать его для мобильных приложений в 2012 году. Спецификация GraphQL была открыта в 2015 году. Сейчас за ней наблюдает GraphQL Foundation .",
      "7": "Существует множество проектов с открытым исходным кодом, в которых используется GraphQL. Приведенный ниже список не является исчерпывающим, но включает проекты, призванные облегчить внедрение GraphQL.",
      "Apollo": "Apollo — платформа GraphQL, включающая клиентскую библиотеку внешнего интерфейса ( Apollo Client ) и инфраструктуру внутреннего сервера ( Apollo Server ).",
      "Offfix": "Offfix — автономный клиент, который позволяет выполнять мутации и запросы GraphQL, даже когда приложение недоступно.",
      "Graphback": "Graphback — клиент командной строки для создания серверов Node.js с поддержкой GraphQL.",
      "OpenAPI-to-GraphQL": "OpenAPI-to-GraphQL — интерфейс командной строки и библиотека для перевода API, описанных в спецификациях OpenAPI или Swagger, в GraphQL."
    },
    "DevelopersAbout": {
      "Vlad": "Влад Тарновский",
      "Aleksei": "Алексей Громов",
      "Denis": "Денис Карначенко",
      "Team": "Наша команда:",
      "Front-end": "Front-end разработчик",
      "Leader": "Руководитель команды"
    },
    "RSSAbout": {
      "1": "RS School — это бесплатная образовательная программа, проводимая сообществом разработчиков The Rolling Scopes с 2013 года.",
      "2": "Учиться в RS School может каждый, независимо от возраста, профессиональной занятости и места жительства. Наставники и тренеры нашей школы — фронтенд- и javascript-разработчики из разных компаний и стран.",
      "3": "RSSchool работает по принципу «Учи вперед». По этому принципу студенты учатся в школе бесплатно, но мы просим их вернуться в качестве наставников, чтобы передать свои знания следующему поколению учеников.",
      "4": "Преимущества RS School:",
      "Advantages1": "Бесплатный курс, никаких обязательств и договоров. С вашей стороны необходимо только время и желание",
      "Advantages2": "Огромное живое и активное сообщество",
      "Advantages3": "Многоплановая учебная программа. Всегда актуальная программа. Сложные и интересные задания. Высокая интенсивность подачи материала и практики. Вам потребуется около 20-40 часов в неделю",
      "Advantages4": "Все материалы находятся в открытом доступе на YouTube и GitHub",
      "Advantages5": "Тренеры из разных компаний и стран. В подавляющем большинстве программисты, а не учителя",
      "Advantages6": "Свой ментор, начиная с второго этапа обучения",
      "Advantages7": "Онлайн занятия. Возможность просмотра лекций на YouTube в любое время",
      "Advantages8": "Оффлайн встречи, митапы, собеседования",
      "Advantages9": "Возможность трудоустройства",
      "Advantages10": "Возможность прохождения различных учебных интервью",
      "Advantages11": "Море возможностей для общения. Вместе учиться интереснее и результативнее",
      "Advantages12": "Дух конкуренции, соревнования и соперничества",
      "Advantages13": "Нет ограничений по возрасту",
      "Advantages14": "Доброжелательная атмосфера, всегда есть люди, желающие помочь",
      "Advantages15": "Курсы можно проходить несколько раз. Обычно около 15% наших студентов учатся повторно."
    }
  },
  "GraphQL": {
    "Variables": "Переменные",
    "Headers": "Хедеры"
  },
  "Setting": {
    "Title": "Настройки",
    "Language": "Язык",
    "Theme": "Тема",
    "Dark": "Темная",
    "Light": "Светлая"
  },
  "AuthorizationPage": {
    "Email": "Email адрес:",
    "Password": "Пароль:",
    "Registration": {
      "headerTitle": "Зарегистрироваться",
      "buttonTitle": "Зарегистрироваться"
    },
    "Login": {
      "headerTitle": "Войти",
      "buttonTitle": "Войти"
    },
    "ErrorMessage": {
      "Email": "Введите Email",
      "EmailDomain": "Недопустимый домен электронной почты",
      "ToShort": "минимум 8 символов",
      "Password": "Введите пароль",
      "Symbols": "должна быть хотя бы одна буква, одна цифра, один специальный символ"
    }
  }
}
